OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/archiveCases/IDDESStabilityTestAlphat/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1296;
        startFace       3013344;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1296;
        startFace       3014640;
    }
    leftSides_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3015936;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftSides_periodic1;
    }
    leftSides_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3030156;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftSides_periodic0;
    }
    rightSides_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3044376;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightSides_periodic1;
    }
    rightSides_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3058596;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightSides_periodic0;
    }
    leftInOut_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3072816;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftInOut_periodic1;
    }
    leftInOut_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3087036;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftInOut_periodic0;
    }
    rightInOut_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3101256;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightInOut_periodic1;
    }
    rightInOut_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          14220;
        startFace       3115476;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightInOut_periodic0;
    }
)

// ************************************************************************* //
